# d1 = {"张三":72,"李四":60,"王五":85}
# print(type(d1),d1)

# d1 = {"张三":72,"李四":60,"王五":85,"张三":99}
# print(d1)

# d1 = {}
# d2 = dict()
# print(type(d1),d1)
# print(type(d2),d2)

# key must be immutable and value cam be any type
# d1 = {"张三":72,"李四":60,"王五":85}
# d2 = {("抽烟","喝酒"):72,"李四":60,"王五":85}
# print(d1)
# print(d2)

#wrong example
# d2 = {["抽烟","喝酒"]:72,"李四":60,"王五":85}

student_dict = {
    2025001:{"姓名":"张三","年龄":18,"成绩":72},
    2025002: {"姓名": "李四", "年龄": 19, "成绩": 60},
    2025003: {"姓名": "王五", "年龄": 20, "成绩": 85},
}

print(student_dict)

